## Terraform Summary

| Step                         | Result  |
|:-----------------------------|:-------:|
| 🖌  Terraform Format & Style | ✅ |
| ⚙️  Terraform Initialization  | ✅ |
| 🤖  Terraform Validation     | ✅ |
| 📖  Terraform Plan           | ✅ |

_**Hint:** If "Terraform Format & Style" failed, run `terraform fmt -recursive` from the `terraform/` directory and commit the results._

### Output

<details>
<summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

<details>
<summary>Plan Output</summary>

```diff

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.lambda_function-cpfValidation.aws_lambda_function.this[0] has changed
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-cpfValidation"
      ~ last_modified                  = "2024-01-10T14:37:41.722+0000" -> "2024-01-10T14:37:58.698+0000"
        # (23 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.lambda_function-excelToJson.aws_lambda_function.this[0] has changed
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-excelToJson"
      ~ last_modified                  = "2024-01-10T14:37:43.770+0000" -> "2024-01-10T14:38:00.744+0000"
        # (23 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place
-   destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_ecs_service.console will be updated in-place
  ~ resource "aws_ecs_service" "console" {
        id                                 = "arn:aws:ecs:us-west-2:357150818708:service/cpfreporter/cpfreporter-console"
        name                               = "cpfreporter-console"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console:32" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.console must be replaced
+/- resource "aws_ecs_task_definition" "console" {
      ~ arn                      = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console:32" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ id                       = "cpfreporter-console" -> (known after apply)
      ~ revision                 = 32 -> (known after apply)
-       tags                     = {} -> null
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_s3_object.lambda_artifact-cpfValidation will be updated in-place
  ~ resource "aws_s3_object" "lambda_artifact-cpfValidation" {
      ~ etag                   = "eae6e9031bd39a0c2adceca7cf999cad-5" -> "04a1fc0c62a2d3a73d69887cbac0b8cb"
        id                     = "cpfValidation.04a1fc0c62a2d3a73d69887cbac0b8cb.zip"
        tags                   = {}
      ~ version_id             = "5T8WQ7TvZ6jypOjseGWfTa7ywwGeSgZe" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.lambda_artifact-excelToJson will be updated in-place
  ~ resource "aws_s3_object" "lambda_artifact-excelToJson" {
      ~ etag                   = "41ce91252ab8d3546fb5905ff561b7c4-6" -> "20739793d622992f3eae2ba77a6afbb0"
        id                     = "excelToJson.20739793d622992f3eae2ba77a6afbb0.zip"
        tags                   = {}
      ~ version_id             = "gPwPrjichUcrBU2_ho8ptAdGaAPp8RRY" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.lambda_artifact-graphql will be updated in-place
  ~ resource "aws_s3_object" "lambda_artifact-graphql" {
      ~ etag                   = "2b183ff7698d06c65a2cc69ff1418a72-6" -> "f8f0fb2de5c813d0dd43c9b981d86451"
        id                     = "graphql.f8f0fb2de5c813d0dd43c9b981d86451.zip"
        tags                   = {}
      ~ version_id             = "QsZfyceN0u.F3DPfaVM_TBHfdhxauXaf" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["200.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "27c4cd48b5f4f49e2a700f06c59ccbb2" -> "26b4ba1df316b898fd04d4aa33fe7033"
        id                     = "dist/200.html"
      ~ source_hash            = "27c4cd48b5f4f49e2a700f06c59ccbb2" -> "26b4ba1df316b898fd04d4aa33fe7033"
        tags                   = {}
      ~ version_id             = "eYYNvCqf9JyH82nJKyD8DWcdYvJmZ7md" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["build-manifest.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "0b0f78a73b20f59a7777968852f42252" -> "3230fb7175d132db128371edce2e0926"
        id                     = "dist/build-manifest.json"
      ~ source_hash            = "0b0f78a73b20f59a7777968852f42252" -> "3230fb7175d132db128371edce2e0926"
        tags                   = {}
      ~ version_id             = "eJBV9_QvaQte3lsfYt2Kjf3jWGhTQVXS" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["chunk-references.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "90271cca082726309d5fcec022f2d51c" -> "9afd05b39afd4d91a002bf2b91273459"
        id                     = "dist/chunk-references.json"
      ~ source_hash            = "90271cca082726309d5fcec022f2d51c" -> "9afd05b39afd4d91a002bf2b91273459"
        tags                   = {}
      ~ version_id             = "8oJZ9VIWxWUhuCohBJyDmsmQlkeh7A_M" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["index.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "27c4cd48b5f4f49e2a700f06c59ccbb2" -> "26b4ba1df316b898fd04d4aa33fe7033"
        id                     = "dist/index.html"
      ~ source_hash            = "27c4cd48b5f4f49e2a700f06c59ccbb2" -> "26b4ba1df316b898fd04d4aa33fe7033"
        tags                   = {}
      ~ version_id             = "HEgeF2vyWprxYt68VY1ScqQOJzNuy_zw" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.65a3fc25.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "b330a241c69dbe4c59a9c08e2dc03a76"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/app.65a3fc25.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.65a3fc25.js"
+       source_hash            = "b330a241c69dbe4c59a9c08e2dc03a76"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.65a3fc25.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "22534f5b586cb736e9cdf4c0742c3fd1"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/app.65a3fc25.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.65a3fc25.js.LICENSE.txt"
+       source_hash            = "22534f5b586cb736e9cdf4c0742c3fd1"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.b30cda02.js"] will be destroyed
  # (because key ["static/js/app.b30cda02.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "7ae0d537d808d557be1a84b74faf8137" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/app.b30cda02.js" -> null
-       key                    = "dist/static/js/app.b30cda02.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.b30cda02.js" -> null
-       source_hash            = "7ae0d537d808d557be1a84b74faf8137" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "xJcik2B.bfuK7BgR3yTc0niHtqntiUkM" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.b30cda02.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/app.b30cda02.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "22534f5b586cb736e9cdf4c0742c3fd1" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/app.b30cda02.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/app.b30cda02.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.b30cda02.js.LICENSE.txt" -> null
-       source_hash            = "22534f5b586cb736e9cdf4c0742c3fd1" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "K3O_xOXca_x3_PiTmlRS72Iu8TTG3ECA" -> null
    }

  # module.lambda_function-cpfValidation.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-cpfValidation"
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-cpfValidation:1" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-cpfValidation:1/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "1" -> (known after apply)
        # (21 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                = "933f8572314ce3084bf34aec3a1f1a333180617a" -> "4305c1b7506b301beee5d80c278e98a2e7c548b5"
              ~ "DD_TAGS"                      = "git.commit.sha:933f8572314ce3084bf34aec3a1f1a333180617a,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:4305c1b7506b301beee5d80c278e98a2e7c548b5,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                   = "933f8572314ce3084bf34aec3a1f1a333180617a" -> "4305c1b7506b301beee5d80c278e98a2e7c548b5"
                # (13 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.lambda_function-cpfValidation.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "1" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function-excelToJson.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-excelToJson"
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-excelToJson:1" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-excelToJson:1/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "1" -> (known after apply)
        # (21 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                = "933f8572314ce3084bf34aec3a1f1a333180617a" -> "4305c1b7506b301beee5d80c278e98a2e7c548b5"
              ~ "DD_TAGS"                      = "git.commit.sha:933f8572314ce3084bf34aec3a1f1a333180617a,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:4305c1b7506b301beee5d80c278e98a2e7c548b5,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                   = "933f8572314ce3084bf34aec3a1f1a333180617a" -> "4305c1b7506b301beee5d80c278e98a2e7c548b5"
                # (13 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.lambda_function-excelToJson.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "1" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function-graphql.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-graphql"
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-graphql:48" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-graphql:48/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "48" -> (known after apply)
        # (21 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                      = "933f8572314ce3084bf34aec3a1f1a333180617a" -> "4305c1b7506b301beee5d80c278e98a2e7c548b5"
              ~ "DD_TAGS"                            = "git.commit.sha:933f8572314ce3084bf34aec3a1f1a333180617a,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:4305c1b7506b301beee5d80c278e98a2e7c548b5,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                         = "933f8572314ce3084bf34aec3a1f1a333180617a" -> "4305c1b7506b301beee5d80c278e98a2e7c548b5"
                # (17 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # module.lambda_function-graphql.aws_lambda_permission.current_version_triggers["APIGateway"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "APIGateway" -> (known after apply)
      ~ qualifier           = "48" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 6 to add, 11 to change, 6 to destroy.
```

</details>

*Pusher: @dependabot[bot], Action: `pull_request_target`, Workflow: [`Continuous Integration`](https://github.com/usdigitalresponse/cpf-reporter/actions/runs/7484506827)*